oic/integrations/AE_ISUPNL_INVENT_MOVEME_ASYNC/icspackage/project/AE_ISUPNL_INVENT_MOVEME_ASYNC/resources/application_988/inbound_989/resourcegroup_990/RunESSJobs_REQUEST_RT.wsdl

<wsdl:definitions         targetNamespace="http://xmlns.oracle.com/cloud/adapter/erp/RunESSJobs_REQUEST"     xmlns:plnk="http://schemas.xmlsoap.org/ws/2003/05/partner-link/"     xmlns:errors="http://xmlns.oracle.com/adf/svc/errors/"     xmlns:orafault="http://xmlns.oracle.com/oracleas/schema/oracle-fault-11_0"     xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"     xmlns:tns="http://xmlns.oracle.com/apps/financials/commonModules/shared/model/erpIntegrationService/"     xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"     xmlns:types="http://xmlns.oracle.com/apps/financials/commonModules/shared/model/erpIntegrationService/types/"     xmlns:ns0="http://xmlns.oracle.com/cloud/adapter/erp/RunESSJobs_REQUEST/types"     xmlns:ns1="http://xmlns.oracle.com/cloud/adapter/erp/RunESSJobs_REQUEST"    >    <casdk:RuntimeIntegrationModel xmlns:casdk="http://xml.oracle.com/wsdl/extensions">        <casdk:sourceWSDLMetadata>            <casdk:serviceName>{http://xmlns.oracle.com/apps/financials/commonModules/shared/model/erpIntegrationService/}ErpIntegrationService</casdk:serviceName>            <casdk:portTypeName>{http://xmlns.oracle.com/apps/financials/commonModules/shared/model/erpIntegrationService/}ErpIntegrationService</casdk:portTypeName>            <casdk:portName>ErpIntegrationServiceSoapHttpPort</casdk:portName>            <casdk:endpointURL>ENDPOINT_URL</casdk:endpointURL>            <casdk:targetWSDLNS>http://xmlns.oracle.com/apps/financials/commonModules/shared/model/erpIntegrationService/</casdk:targetWSDLNS>            <casdk:soapVersion>SOAP11</casdk:soapVersion>        </casdk:sourceWSDLMetadata>    </casdk:RuntimeIntegrationModel>    <plnk:partnerLinkType name="submitESSJobRequest_plt">        <plnk:role name="submitESSJobRequest_role">            <plnk:portType name="ns1:RunESSJobs_REQUESTPortType"/>        </plnk:role>    </plnk:partnerLinkType>    <wsdl:types>        <xs:schema xmlns="http://xmlns.oracle.com/cloud/adapter/erp/RunESSJobs_REQUEST/types" elementFormDefault="qualified"             xmlns:xs="http://www.w3.org/2001/XMLSchema" targetNamespace="http://xmlns.oracle.com/cloud/adapter/erp/RunESSJobs_REQUEST/types">            <xs:element name="submitESSJobRequest" type="xs:anyType"/>            <xs:element name="submitESSJobRequestResponse" type="xs:anyType"/>        </xs:schema>        <xs:schema xmlns="http://xmlns.oracle.com/adf/svc/errors/" elementFormDefault="qualified"             xmlns:xs="http://www.w3.org/2001/XMLSchema" targetNamespace="http://xmlns.oracle.com/adf/svc/errors/">            <xs:element name="ServiceErrorMessage" type="xs:anyType"/>        </xs:schema>    </wsdl:types>    <wsdl:message name="submitESSJobRequestRequestMessage">        <wsdl:part name="parameters" element="ns0:submitESSJobRequest"/>    </wsdl:message>    <wsdl:message name="submitESSJobRequestResponseMessage">        <wsdl:part name="parameters" element="ns0:submitESSJobRequestResponse"/>    </wsdl:message>    <wsdl:message name="ServiceException">        <wsdl:part name="parameters" element="errors:ServiceErrorMessage"/>    </wsdl:message>    <wsdl:portType name="RunESSJobs_REQUESTPortType">        <wsdl:operation name="submitESSJobRequest">            <cloud:CloudOperation xmlns:cloud="http://xml.oracle.com/types" targetOperation="submitESSJobRequest"/>            <wsdl:input message="ns1:submitESSJobRequestRequestMessage"/>            <wsdl:output message="ns1:submitESSJobRequestResponseMessage"/>            <wsdl:fault name="ServiceException" message="ns1:ServiceException"/>        </wsdl:operation>    </wsdl:portType></wsdl:definitions>